cases/2D/discSteadyUniformFlow/squareMesh/deltaX0.02/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale 1;

vertices        
(
    (0 0 0) //0
    (5 0 0) //1
    (5 3 0) //2
    (0 3 0) //3
    (0 0 0.1) //4
    (5 0 0.1) //5 
    (5 3 0.1) //6
    (0 3 0.1) //7

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (250 150 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (0 4 5 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (2 3 7 6)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

